In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df=pd.DataFrame([('Foreign Cinema', 'Restaurant'),
                   ('Liho Liho', 'Restaurant'),
                   ('500 Club', 'bar'),
                   ('The Square', 'bar')],
           columns=('name', 'type')
                 )

In [4]:
df

             name        type
0  Foreign Cinema  Restaurant
1       Liho Liho  Restaurant
2        500 Club         bar
3      The Square         bar

To import any data to excel use the function: to_csv()

In [5]:
df.to_csv('cinema.csv')

To remove Index Number from csv file:

In [6]:
df.to_csv('cinema_indexFalse.csv', index=False)

To see first n number of rows from the dataset:

In [7]:
df.head(2)

             name        type
0  Foreign Cinema  Restaurant
1       Liho Liho  Restaurant

To see last n number of rows from the dataset:

In [8]:
df.tail(2)

         name type
2    500 Club  bar
3  The Square  bar

To decribe the data:

In [9]:
df.describe()

                  name        type
count                4           4
unique               4           2
top     Foreign Cinema  Restaurant
freq                 1           2

To read a CSV file:

In [10]:
Trains=pd.read_csv('Train.csv')

In [11]:
Trains

   Train No.  Speed    City
0      12345     58   Delhi
1      12456     89  Mumbai
2      12567     98  Bhopal
3      12789     91    Agra

To change particular value of a column:

In [12]:
Trains['Speed'][0]

58

In [13]:
Trains['Speed'][0]=78

C:\Users\KIIT\AppData\Local\Temp\ipykernel_7876\3715619123.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Trains['Speed'][0]=78

In [14]:
Trains

   Train No.  Speed    City
0      12345     78   Delhi
1      12456     89  Mumbai
2      12567     98  Bhopal
3      12789     91    Agra

To change Index format:

In [15]:
Trains.index=['First','Second','Third','Fourth']

In [16]:
Trains

        Train No.  Speed    City
First       12345     78   Delhi
Second      12456     89  Mumbai
Third       12567     98  Bhopal
Fourth      12789     91    Agra

Create series:

In [17]:
ser=pd.Series(np.random.rand(34))

In [19]:
type(ser)

pandas.core.series.Series

Create dataframe:

In [21]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [22]:
newdf.head()

          0         1         2         3         4
0  0.316259  0.001155  0.404957  0.206229  0.841582
1  0.527631  0.397177  0.982227  0.515780  0.241216
2  0.633958  0.209539  0.353063  0.533262  0.749163
3  0.390031  0.316173  0.175908  0.978203  0.871959
4  0.872031  0.912447  0.818512  0.863403  0.236339

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [25]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.514501    0.485565    0.505868    0.501603    0.483090
std      0.282152    0.295838    0.289656    0.294572    0.283561
min      0.001076    0.000782    0.000011    0.001482    0.004164
25%      0.263065    0.221811    0.272285    0.251506    0.224289
50%      0.512037    0.477344    0.489142    0.511288    0.488042
75%      0.748267    0.743774    0.754715    0.768437    0.718520
max      0.995734    0.999158    0.995251    0.999607    0.991046

In [27]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
 newdf[0][0]="Suvansh"

In [29]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf.head()

          0         1         2         3         4
0   Suvansh  0.001155  0.404957  0.206229  0.841582
1  0.527631  0.397177  0.982227  0.515780  0.241216
2  0.633958  0.209539  0.353063  0.533262  0.749163
3  0.390031  0.316173  0.175908  0.978203  0.871959
4  0.872031  0.912447  0.818512  0.863403  0.236339